backend/service/NineNine/NineNineNewService.php

    private static function __init($uid = 1, $tz_system_id = 2){
        //$User = User::findOne($uid);
        $User = AdminModel::findOne($uid);
---
SELECT * FROM `lt_admin` WHERE `id`=11

    public static function synBalance($tz_system_user_id){
        $TzSystemsUsers = TzSystemsUsers::findOne($tz_system_user_id);
        $balance = self::getBalance($TzSystemsUsers->uid,$TzSystemsUsers->tz_system_id);
        $msg = ['status'=>200, 'msg'=>'金额同步成功~','tz_system_user_id'=>$tz_system_user_id, 'balance'=>$balance ];

        $TzSystemsUsers->balance = $balance;
        $TzSystemsUsers->updated_at = time();
        if(!$TzSystemsUsers->save()){
---
UPDATE `lt_tz_systems_users` SET `balance`=NULL, `updated_at`=1613988122 WHERE `id`=32