backend/service/HN0898Service.php

SELECT actionNo FROM `lt_data_time` WHERE actionTime >= '18:01:01' AND type=6 ORDER BY id ASC
---
                    $qihao = date("Ymd").sprintf("%02d", $rst['actionNo']);
                }elseif('00:00:00'<$time && $time<'02:00:00'){
                    $where = ['AND',['=','type', $lottery_type],['>=', 'actionTime', $time],['between', 'actionTime','00:00:00','02:00:00']];
                    $rst = DataTime::find($where)->where($where)->asArray()->one();