backend/models/ImportPlanCodesQuery.php

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM `lt_import_plan_codes` WHERE `plan_id`=1644