backend/models/TzSystemsAuthQuery.php

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM `lt_tz_systems_auth` WHERE `uid`='11'