backend/models/TzSystemsUsersQuery.php

SELECT * FROM `lt_tz_systems_users` WHERE (`uid`=11) AND (`tz_system_id`='12')
---
    public function one($db = null)
    {
        return parent::one($db);