backend/models/TzTypesQuery.php

SELECT * FROM `lt_tz_types` WHERE `type`=34
---
    public function one($db = null)
    {
        return parent::one($db);