/*
Navicat MySQL Data Transfer

Source Server         : 154.83.17.96(香港)
Source Server Version : 50643
Source Host           : 154.83.17.96:3306
Source Database       : lottery_xl

Target Server Type    : MYSQL
Target Server Version : 50643
File Encoding         : 65001

Date: 2019-05-08 10:16:34
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `lt_ssc_ds_yl`
-- ----------------------------
DROP TABLE IF EXISTS `lt_ssc_ds_yl`;
CREATE TABLE `lt_ssc_ds_yl` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `positions` varchar(8) DEFAULT NULL COMMENT '位置',
  `zhi` varchar(120) DEFAULT NULL COMMENT '值',
  `current_miss` smallint(8) DEFAULT NULL COMMENT '本期遗漏',
  `last_time_miss` smallint(8) DEFAULT NULL COMMENT '上次遗漏',
  `last_time_miss_range` varchar(64) DEFAULT NULL COMMENT '上次遗漏范围',
  `max_miss` tinyint(4) DEFAULT NULL COMMENT '最大遗漏(近200期)',
  `max_range` varchar(64) DEFAULT NULL COMMENT '最大遗漏范围(近200期)',
  `yl_records` text COMMENT '遗漏记录',
  `history_max_miss` smallint(8) DEFAULT NULL COMMENT '历史最大遗漏',
  `type` tinyint(1) DEFAULT NULL COMMENT '1一定2二定3三定4四定',
  `lottery_type` tinyint(4) DEFAULT '2' COMMENT '彩种类型：1:1.5分 2:3分 3:5分 4:10分|希腊、5:重庆ssc 6:新疆ssc',
  `created_at` int(11) DEFAULT NULL COMMENT '创建时间',
  `updated_at` int(11) DEFAULT NULL COMMENT '更新时间',
  `update_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`),
  KEY `positions` (`positions`),
  KEY `zhi` (`zhi`),
  KEY `type` (`type`)
) ENGINE=InnoDB AUTO_INCREMENT=83 DEFAULT CHARSET=utf8 COMMENT='定位单双遗漏表';

-- ----------------------------
-- Records of lt_ssc_ds_yl
-- ----------------------------
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2', '11', '0', '0', '-', null, '-', '0-', '25', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2', '12', '0', '0', '-', null, '-', '0-', '24', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2', '21', '0', '0', '-', null, '-', '0-', '20', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2', '22', '0', '0', '-', null, '-', '0-', '22', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,3', '11', '0', '0', '-', null, '-', '0-', '22', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,3', '12', '0', '0', '-', null, '-', '0-', '32', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,3', '21', '0', '0', '-', null, '-', '0-', '24', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,3', '22', '0', '0', '-', null, '-', '0-', '24', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,4', '11', '0', '0', '-', null, '-', '0-', '22', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,4', '12', '0', '0', '-', null, '-', '0-', '22', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,4', '21', '0', '0', '-', null, '-', '0-', '40', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,4', '22', '0', '0', '-', null, '-', '0-', '22', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '2,3', '11', '0', '0', '-', null, '-', '0-', '23', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '2,3', '12', '0', '0', '-', null, '-', '0-', '32', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '2,3', '21', '0', '0', '-', null, '-', '0-', '25', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '2,3', '22', '0', '0', '-', null, '-', '0-', '27', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '2,4', '11', '0', '0', '-', null, '-', '0-', '31', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '2,4', '12', '0', '0', '-', null, '-', '0-', '21', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '2,4', '21', '0', '0', '-', null, '-', '0-', '22', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '2,4', '22', '0', '0', '-', null, '-', '0-', '25', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '3,4', '11', '0', '0', '-', null, '-', '0-', '39', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '3,4', '12', '0', '0', '-', null, '-', '0-', '22', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '3,4', '21', '0', '0', '-', null, '-', '0-', '24', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '3,4', '22', '0', '0', '-', null, '-', '0-', '23', '2', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3', '111', '0', '0', '-', null, '-', '0-', '44', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3', '112', '0', '0', '-', null, '-', '0-', '46', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3', '121', '0', '0', '-', null, '-', '0-', '40', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3', '211', '0', '0', '-', null, '-', '0-', '54', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3', '122', '0', '0', '-', null, '-', '0-', '47', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3', '212', '0', '0', '-', null, '-', '0-', '38', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3', '221', '0', '0', '-', null, '-', '0-', '43', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3', '222', '0', '0', '-', null, '-', '0-', '52', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,4', '111', '0', '0', '-', null, '-', '0-', '39', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,4', '112', '0', '0', '-', null, '-', '0-', '37', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,4', '121', '0', '0', '-', null, '-', '0-', '50', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,4', '211', '0', '0', '-', null, '-', '0-', '54', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,4', '122', '0', '0', '-', null, '-', '0-', '42', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,4', '212', '0', '0', '-', null, '-', '0-', '36', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,4', '221', '0', '0', '-', null, '-', '0-', '58', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,4', '222', '0', '0', '-', null, '-', '0-', '42', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,3,4', '111', '0', '0', '-', null, '-', '0-', '44', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,3,4', '112', '0', '0', '-', null, '-', '0-', '45', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,3,4', '121', '0', '0', '-', null, '-', '0-', '67', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,3,4', '211', '0', '0', '-', null, '-', '0-', '64', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,3,4', '122', '0', '0', '-', null, '-', '0-', '45', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,3,4', '212', '0', '0', '-', null, '-', '0-', '51', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,3,4', '221', '0', '0', '-', null, '-', '0-', '46', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,3,4', '222', '0', '0', '-', null, '-', '0-', '44', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '2,3,4', '111', '0', '0', '-', null, '-', '0-', '61', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '2,3,4', '112', '0', '0', '-', null, '-', '0-', '37', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '2,3,4', '121', '0', '0', '-', null, '-', '0-', '56', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '2,3,4', '211', '0', '0', '-', null, '-', '0-', '45', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '2,3,4', '122', '0', '0', '-', null, '-', '0-', '48', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '2,3,4', '212', '0', '0', '-', null, '-', '0-', '44', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '2,3,4', '221', '0', '0', '-', null, '-', '0-', '44', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '2,3,4', '222', '0', '0', '-', null, '-', '0-', '45', '3', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '2221', '0', '0', '-', null, '-', '0-', '86', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '1112', '0', '0', '-', null, '-', '0-', '70', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '1121', '0', '0', '-', null, '-', '0-', '89', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '1122', '0', '0', '-', null, '-', '0-', '115', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '1211', '0', '0', '-', null, '-', '0-', '84', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '1212', '0', '0', '-', null, '-', '0-', '88', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '1221', '0', '0', '-', null, '-', '0-', '121', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '1222', '0', '0', '-', null, '-', '0-', '101', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '2111', '0', '0', '-', null, '-', '0-', '109', '4', '2', '1550738447', '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '2112', '0', '0', '-', null, '-', '0-', '73', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '2121', '0', '0', '-', null, '-', '0-', '88', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '2122', '0', '0', '-', null, '-', '0-', '64', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '2211', '0', '0', '-', null, '-', '0-', '87', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '2212', '0', '0', '-', null, '-', '0-', '64', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '1111', '0', '0', '-', null, '-', '0-', '78', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '2222', '0', '0', '-', null, '-', '0-', '80', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '1111,2222', '0', '0', '-', null, '-', '0-', '45', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '1222,2122,2212,2221', '0', '0', '-', null, '-', '0-', '23', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '2111,1211,1121,1112', '0', '0', '-', null, '-', '0-', '27', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '1222,2122,2212,2221,2222', '0', '0', '-', null, '-', '0-', '16', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '2111,1211,1121,1112,1111', '0', '0', '-', null, '-', '0-', '22', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '1222,2122,2212,2221,1111', '0', '0', '-', null, '-', '0-', '22', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '2111,1211,1121,1112,2222', '0', '0', '-', null, '-', '0-', '27', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '1122,1212,1221,2112,2121,2211', '0', '0', '-', null, '-', '0-', '13', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '1222,2122,2212,2221,1111,2222', '0', '0', '-', null, '-', '0-', '16', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
INSERT INTO `lt_ssc_ds_yl` VALUES ('', '1,2,3,4', '2111,1211,1121,1112,2222,1111', '0', '0', '-', null, '-', '0-', '15', '4', '2', null, '1557281727', '2019-05-08 10:15:27');
